---
kind: other
id: Properties.T:Autodesk.Revit.DB.BeamSystemType
source: html/2bb3d633-7677-d980-47bb-f5ddc1ec2de5.htm
---
# BeamSystemType Properties

The id of the assembly instance to which the element belongs.